<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"3ec88e4c3f8f9ca05f61372c9c09a5e10d84be3bfeb8f70bd124da7d45505665","plan_job_ref":"Job Pull Request Checks #4586 at https://github.com/GSA-TTS/FAC/actions/runs/14385613932","plan_out_hash":"1fe9681128b44b959c14c71863a15475a872cab79cb4dc345f8179bf369e4135","plan_hash":"93bb2ec0840f4a16a589fcb4bfdd0f519629ee334b2a3253e3622a6bb2dd7bf8","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 5 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.domain.cloudfoundry_route.origin_route_connected[0] will be updated in-place
!~  resource "cloudfoundry_route" "origin_route_connected" {
!~      destinations = [
-           {
-               app_id           = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
-               app_process_type = "web" -> null
-               id               = "1017be0d-b11c-4241-a150-3a9abcc0dff4" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "e83a78c3-6efc-4cf3-b5be-064693423601"
#        (7 unchanged attributes hidden)
    }

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "41e96938-1383-c2ce-3157-af85063feaa3"

-       policy {
-           destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "15290fef-8636-4e27-9b57-c86318f85cc8" -> null
        }
-       policy {
-           destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "15290fef-8636-4e27-9b57-c86318f85cc8"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "bffa4f44-73e2-295d-6c7e-2809a21406d6"

-       policy {
-           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
        }
-       policy {
-           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
        }
+       policy {
+           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:296c46bb74c5a29e4b71aa0d46a8518dd379b4410026a9a3ab97b0ea8fc7b4bd" -> "ghcr.io/gsa-tts/fac/clamav@sha256:613e32da4c4c3207cf8f1e7ed7f04f0a34f4db14b7404f3cc0b6bf78be90fad8"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-02T17:24:26Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-02T17:35:54Z" -> (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:296c46bb74c5a29e4b71aa0d46a8518dd379b4410026a9a3ab97b0ea8fc7b4bd" -> "ghcr.io/gsa-tts/fac/clamav@sha256:613e32da4c4c3207cf8f1e7ed7f04f0a34f4db14b7404f3cc0b6bf78be90fad8"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-02T17:24:26Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4586](https://github.com/GSA-TTS/FAC/actions/runs/14385613932)